//
//  FriendCircleData.m
//  DDCoreText
//
//  Created by 刘和东 on 2018/7/30.
//  Copyright © 2018年 DDCoreText. All rights reserved.
//

#import "FriendCircleData.h"

@implementation FriendCircleData

/** 名字 */
+ (NSArray *)namesArray
{
    NSArray * arr = @[@"光速", @"出单队", @"精英队", @"精英", @"风启",
                      @"野狼盟", @"篮球人", @"秃鸡队", @"奔驰财团", @"永创第一",
                      @"胜羽队", @"巨人队", @"同路人", @"18新秀", @"奇迹",
                      @"无敌队", @"给力", @"天一", @"飞虎队", @"超越队",
                      @"NIKE队", @"飞跃", @"农夫山泉队", @"兄弟盟", @"完美之神",
                      @"百事队", @"风之彩", @"美特斯邦威", @"我们", @"跃起动力"];
    return arr;
}

/** 内容数组 */
+ (NSArray *)contentArray
{
    NSArray * arr = @[@"土地是12345678910以它的肥066-22334455沃和收获而被估价的；才能也是土地，不过它生产的不是粮食，而是12345真理123456。如果只能滋生瞑想和幻想的话，即使再大的才能也只是136933436321砂地或盐池，12345668那上面连小草也066-223344长不出来的。土地是以它的肥沃和收获而被估价的；才能也是土地，不过它生产的不是粮食，而是真理。如果www.baidu.com只能滋生http://msg.baidu.com/?t=1533945818瞑想和幻想的话，即使再大的才能也只是砂地或盐池，那上面连小草也长不出来的。土地是以它的肥沃和收获而被估价的；才能也是土地，不过它生产的不是粮食，而是真理。如果只能滋生瞑想和幻想的话，即使再大的才能也只是砂地或盐池，那上面连小草也长不出来的。",
                      @"我需136933436321要三件东西12345678910：爱情123456友谊和图书。然而这12345三者之间何其相通！炽热的066-2233445爱情可以充实图书的内容，图书又是人们最忠实的朋友12345668。我需1234566要三件东西：爱情友谊和图书。然而这三者之间何其相通！炽热的爱情可以充实图书的内容，图书又是人们最忠实的朋友。我需http://msg.baidu.com/?t=1533945818要三件东西：爱情友谊和图书。然而这三者之间何其相通！炽热的爱情可以充实图书的内容，图书又是人们最忠https://www.baidu.com/实的朋友。我需要三件东西：爱情友谊和图书。然而这三者之间何其相通！炽热的爱情可以充实图书的内容，图书又是人们最忠实的朋友。",
                      @"人生的1234567891磨难是很多的，所123456以我们不可对于每12345一件轻微的伤害都过于敏感。在生活磨难面前，精神上的坚066-22334455强和无动于衷是我们抵抗罪恶和人生意外的最好武器人生的磨难是很多的，所以066-2233446我们不可对于每一件轻微的伤害都过于敏感。在生活磨难面前，精136933436321神上的坚强和无动于衷是我们抵抗罪https://www.baidu.com/恶和人生意外的最好武器人生的磨难是很多的，所以我们不可对于每一件轻微的伤害都过于敏感。在生活磨难面前，精神上的坚强和无动于衷是我们抵抗罪恶和人生意外的最好武器",
                      @"爱情只1234567891有当它是自由自在时12345668，才会叶茂花繁。认为爱情是某种义务的思想只能置爱情于死地。066-22334455只消一句话：你应当爱某个人，就足以使你对这个人恨之入骨。爱情只有当它是自由自在时，才会叶茂花繁。认为爱情是某种义务的思想只能置爱情于死地。只消一句话：你应当爱某个人，https://www.baidu.com/就足以使你对这个人恨之入骨。",
                      @"温顺的1234567891青年人在图书馆里长大，他们相信他们的责任是应当接受西塞罗，洛克，培根发表的意见；他们忘了西塞罗，洛克与培根写这些书的时候，也不过是在图书馆里的青年人。",
                      @"较高级123456789复杂的劳动，是这样一种劳动力的表现，这种劳动力比较普通的劳动力需要较高的教育费用，它的生产需要花费较多的劳动时间。因此，具有较高的价值。",
                      @"父亲子066-223344兄弟12345668姊妹等称谓，并不是简单的荣誉称号，而是一种负有完全确定的异常郑重的相互义务的称呼，这些066-22334455义务的总和便构成这些民族的社会制度的实质部http://msg.baidu.com/?t=1533945818分。",
                      @"世界上没136933436321有才能的人是没有的。问题在于教http://msg.baidu.com/?t=1533945818育者要066-223344去发现每一位学生的禀赋、兴趣、爱好和特长，为他们的表现和发展提供充分的条件和正确引导。",
                      @"在人类1234567891历史066-22334455的长河中，真理因为像黄金一样重，总是沉于河底而很难被人发现，相反地，那些牛粪一样轻的谬误倒漂浮在上面到处泛滥。在人类历史的长http://msg.baidu.com/?t=1533945818河中，真066-22334455理因为像黄金一样重，总是沉于河底而很难被人发现，相反地，那些牛粪一样轻的谬误倒漂浮在上面到处泛滥。",
                      @"要永远觉12345668得祖国的土地是稳固地在http://msg.baidu.com/?t=1533945818你脚下，要与集体一起生活，要记住，是集体教育了你。那一天你若和集体脱离，那便是末路的开始。",
                      @"感觉12345668可以",
                      @"感觉可以",
                      @"感觉12345668可以",
                      @"感觉23可以11111111111111111111111",
                      @"感觉24可以111111111111111111111111",
                      @"感觉可以",
                      @"",
                      @"",
                      @"",
                      @"",
                      @"感觉24可以111111111111111111111111",
                      @"感觉24可以111111111111111111111111",
                      @"感觉23可以11111111111111111111111",
                      @"感觉23可以11111111111111111111111",
                      @"感觉23可以11111111111111111111111",
                      @"感觉24可以111111111111111111111111",
                      @"感觉23可以11111111111111111111111"];
    
    return arr;
}

/** 图片数组 */
+ (NSArray *)imageUrlArray
{
    NSArray * arr = @[
                      
                      @"http://a0.att.hudong.com/31/35/300533991095135084358827466.jpg",
                      @"http://pic10.nipic.com/20100926/2874022_122448852398_2.jpg",
                      @"http://img1.3lian.com/2015/a1/105/d/40.jpg",
                      @"http://pic21.nipic.com/20120528/7487615_092947555158_2.jpg",
                      @"http://img1.3lian.com/2015/w22/87/d/105.jpg",
                      @"https://wx2.sinaimg.cn/mw1024/006II2JPgy1gjzg9bh7w6j33402c0x6q.jpg",
                      @"http://wx3.sinaimg.cn/bmiddle/005FAKE1gy1ffxgx6rur3j30qo140q7t.jpg",
                      @"https://wx2.sinaimg.cn/mw690/6852466cly1gjxxru82uij216o1ryx4c.jpg",
                      @"https://wx3.sinaimg.cn/mw1024/003yHo7Nly1gjhwrl2necj61o02yo1l302.jpg"
                      ];
    return arr;

}

/** 时间数组 */
+ (NSArray *)timeArray
{
    NSArray * arr = @[@"1分钟前", @"5分钟前", @"10分钟前", @"20分钟前", @"1小时前",
                      @"2小时前", @"3小时前", @"4小时前", @"4小时前", @"5小时前",
                      @"6小时前", @"7小时前", @"8小时前", @"9小时前", @"10小时前",
                      @"11小时前", @"一天前", @"两天前", @"三天前", @"五天前",
                      @"十天前", @"半个月前", @"一个月前", @"两个月前", @"五个月前",
                      @"8个月前", @"一年前", @"二年前", @"五年前", @"10年前"];
    
    return arr;
}

/** 评论内容数组 */
+ (NSArray *)commentContentArray
{
    NSArray * arr = @[@"在强者的眼中，https://www.baidu.com没有最好，只有更好。",
                      @"盆景秀木正066-22336688兄弟12345668因为被人溺爱，才破灭了成为栋梁之材的梦。",
                      @"永远都不要放弃自己\n，勇往直前，直至成功！",
                      @"没有平日http://msg.baidu.com/?t=1533945818的失败，就没有最终的成功。重要的是分析失败原因并吸取教训。",
                      @"蝴蝶如要在百花园里066-22336688兄弟12345668得到飞舞的欢乐，那首先得忍受与蛹决裂的痛苦。",
                      @"萤火虫的光点虽\n然微弱，但亮着便是向黑暗挑战。",
                      @"面对人生旅http://msg.baidu.com/?t=1533945818途中的挫折与磨难，我们不仅要有勇气，更要有坚强的信念。",
                      @"对坚强的人来\n说，不幸就像铁犁一样开垦着他内心的大地，虽然痛，却可以播种。",
                      @"想而奋进的过程，其意义远大于未知的结果。",
                      @"上有天，下有地\n，中间站着你自己，做一天人，尽一天人事儿。",
                      @"努力向上的开\n拓，才使弯曲的竹鞭化作了笔直的毛竹。",
                      @"只要你确信自己正确就去做。做了有人说不好，不做还是有人说不好，不要逃避批判。",
                      @"对没志气的人，路程显得远；对没有银钱的人，城镇显得远。",
                      @"生命力的意义在于拼搏，因为世界本身就是一个竞技场。",
                      @"通过云端的道路，只亲吻攀登者的足迹。",
                      @"不经巨大的困难，http://msg.baidu.com/?t=1533945818不会有伟大的事业。",
                      @"泉水，奋斗之路越曲折，心灵越纯洁。",
                      @"人的一生，可以有066-22336688兄弟12345668所作为的时机只有一次，那就是现在。",
                      @"对于攀登者来说，失掉往昔的足迹并不可惜，迷失了继续前时的方向却很危险。",
                      @"生命的道路上永远066-22336688兄弟12345668没有捷径可言，只有脚踏实地走下去。",
                      @"时间顺流而下，生活逆水行舟。",
                      @"一个人，只要知道付出爱与关心，她内心自然会被爱与关心充满。",
                      @"你要求的次数愈多，066-22336688兄弟12345668你就越容易得到你要的东西，而且连带地也会得到更多乐趣。",
                      @"有大快乐的人，必有大哀痛；有大成功\n的人，必有大孤独。",
                      @"成功等于目标，其他http://msg.baidu.com/?t=1533945818都是这句话的注解。",
                      @"生命之长短殊不重要，只要你活得快乐，在有生之年做些有意义的事，便已足够。",
                      @"路在自己脚下，没有人066-22336688兄弟12345668可以决定我的方向。",
                      @"命运是不存在的，它不过是失败者拿来逃避现实的借口。",
                      @"生命太过短暂\n，今天066-22336688兄弟12345668放弃了明天不一定能得到。",
                      @"改变自我，挑战自我，从现在开始。"];
    return arr;
}


/** 随机名字 */
+ (NSString *)randomName
{
    int row = arc4random() % [self namesArray].count;
    return [self namesArray][row];
}
/** 随机内容 */
+ (NSString *)randomContent
{
    int row = arc4random() % [self contentArray].count;
    return [self contentArray][row];
}
/** 随机图片地址 */
+ (NSString *)randomImageUrl
{
    int row = arc4random() % [self imageUrlArray].count;
    return [self imageUrlArray][row];
}
/** 随机时间 */
+ (NSString *)randomTime
{
    int row = arc4random() % [self timeArray].count;
    return [self timeArray][row];
}
/** 随机评论内容 */
+ (NSString *)randomCommentContent
{
    int row = arc4random() % [self commentContentArray].count;
    return [self commentContentArray][row];
}

/** 随机数 */
+ (NSInteger)randomMin
{
    NSInteger row = [self random] + 100;
    return row;
}

/** 随机数 */
+ (NSInteger)random
{
    NSInteger row = arc4random() % 50;
    return row;
}

@end
